Courses/4420/Lectures/2020-08-25/index.org

# -*- mode: org -*-
#+date: 2020-08-25
#+TITLE: CEG4420/6420 \bull{} 2020-08-25
#+AUTHOR: Prabhaker Mateti
#+HTML_LINK_HOME: ../../Top/index.html
#+HTML_LINK_UP: ../
#+HTML_HEAD: <style> P,li {text-align: justify} code {color: brown;} @media screen {BODY {margin: 10%} }</style>
#+BIND: org-html-preamble-format (("en" "<a href=\"../../\"> ../../</a>"))
#+BIND: org-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2020 <a href=\"http://www.wright.edu/~pmateti\">www.wright.edu/~pmateti</a> &bull; %d"))
#+STARTUP:showeverything
#+OPTIONS: toc:0

* Announcements/ Reminders

1. Visit the course home page frequently.  Start here:
   https://cecs.wright.edu/~pmateti

2. This course uses Linux exclusively.
   1. [[http://cecs.wright.edu/~pmateti/Courses/2350/][CEG 2350: OS Concepts and Usage]] Prerequisite
   2. [[https://cecs.wright.edu/~pmateti/Courses/4350/Top/][CEG 4350/6350: OS Internals and Design]] Recommended
   3. Go through these two courses to (re-) learn Linux and OSs, in
      general.

1. I take cheating seriously. One case of cheating, and you will get
   an F in the entire course.

* Agenda

1. Today = CEG4420 First Day of Classes [I may not always list 6420,
   but whenever 4420 is mentioned it is included.]
2. [[../Overview/welcome.org][Welcome]] message.  Remote Teaching.
3. *Videos to watch* on Pilot -> Panopto:
   1. [[https://wrightstate.hosted.panopto.com/Panopto/Pages/Viewer.aspx?id=87600ef2-c180-443a-ab47-ac22004bd28a][Lecture Video 2020-08-25]] going through these notes. About 30 min
      long.  Pay attention to the due dates shown here.
   2. Additional detail from a last year's video.  Lecture recorded in
      our Distance Learning room.  Face-to-face students and others.
      [[https://wrightstate.hosted.panopto.com/Panopto/Pages/Viewer.aspx?id=dcb3811e-a313-4ffa-b2f1-ac21014005ac][HCS-Lecture-on-08-26-2019]] about 60 min.  Ignore the due dates
      shown here.

** Pilot

1. CEG 4420/6420 Sections 01.  
2. WSU Pilot for submission of your work -- surveys, discussion, lab
   reports, and exams.
3. WSU Pilot does *not* store my lecture notes.  The videos are stored
   within Pilot Panopto.
1. https://cecs.wright.edu/~pmateti/Courses/4420/Top/ has links to
   full lecture notes.


** Survey of Background

1. Survey of your background: OS Internals and Design; Official Prereq: CEG4350
1. Did you take [the equivalent of] CEG 4350/6350 at WSU or elsewhere?
   When? What was your textbook?
1. What Do you Think is: "Host Computer Security"?
1. "Computer Security"   [dropped the word Host]?  
1. "Cyber Security"?  
1. "Network Security"? 
1. Post your answers on Pilot Discussion.  [This has a couple of extra
   questions compared to what is on Pilot.]

** Course Overview

1. [[../Overview/4420-syllabus.html][Read the syllabus]]
1. Several Labs, No Homework, Two Exams
1. Books and other source material
1. What is Required Reading and Recommended Reading
1. Grading is "curved", but not necessarily to obtain a Gaussian distribution.
1. The due dates shown are tentative.
1. *CEG6420: Extra Tasks.*

** Terminology

1. Terminology: Hacker v. Attacker v. Intruder, DoS (Denial of
   Service), Black Hats v. White Hats
1. [[../Overview/index.html][Introduction to the Security Course]]

** L1 Getting Started

1. Lab on Getting Started  [[../LinuxSetup/gettingStartedLab.html]]
1. DAC and =sudo=.  Read =man sudoers=
1. Study a Few Tiny Programs
1. Boot Up [Course Home Page]

** Study a Few Tiny Programs

1. [[../LinuxSetup/StudyPrograms/index.org]] About 10.  Understand every
   line of code.  syscalls. library calls.  strace. ltrace.
1. Task: Compile, run, and observe a few tiny programs
1. [These topics are covered in CEG2350  and CEG4350.]

* Recommended News Reading

1. A goal of this course is to be aware of current security incidents.
2. At an OS-internals level.  Way deeper than CNN TV e.g.
3. For now, start with
   2. https://cve.mitre.org/cve/
   1. https://packetstormsecurity.com/ 
   3. https://SecurityFocus.com
4. More links added later.

* End
# Local variables:
# after-save-hook: org-html-export-to-html
# end:



