Courses/4420/Lectures/2020-08-25/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-26 Wed 07:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CEG4420/6420 &bull; 2020-08-25</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">CEG4420/6420 &bull; 2020-08-25</h1>

<div id="outline-container-orgc02d70e" class="outline-2">
<h2 id="orgc02d70e"><span class="section-number-2">1</span> Announcements/ Reminders</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Visit the course home page frequently.  Start here:
<a href="https://cecs.wright.edu/~pmateti">https://cecs.wright.edu/~pmateti</a></li>

<li>This course uses Linux exclusively.
<ol class="org-ol">
<li><a href="http://cecs.wright.edu/~pmateti/Courses/2350/">CEG 2350: OS Concepts and Usage</a> Prerequisite</li>
<li><a href="https://cecs.wright.edu/~pmateti/Courses/4350/Top/">CEG 4350/6350: OS Internals and Design</a> Recommended</li>
<li>Go through these two courses to (re-) learn Linux and OSs, in
general.</li>
</ol></li>

<li>I take cheating seriously. One case of cheating, and you will get
an F in the entire course.</li>
</ol>
</div>
</div>

<div id="outline-container-org3b53958" class="outline-2">
<h2 id="org3b53958"><span class="section-number-2">2</span> Agenda</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Today = CEG4420 First Day of Classes [I may not always list 6420,
but whenever 4420 is mentioned it is included.]</li>
<li><a href="../Overview/welcome.html">Welcome</a> message.  Remote Teaching.</li>
<li><b>Videos to watch</b> on Pilot -&gt; Panopto:
<ol class="org-ol">
<li><a href="https://wrightstate.hosted.panopto.com/Panopto/Pages/Viewer.aspx?id=87600ef2-c180-443a-ab47-ac22004bd28a">Lecture Video 2020-08-25</a> going through these notes. About 30 min
long.  Pay attention to the due dates shown here.</li>
<li>Additional detail from a last year's video.  Lecture recorded in
our Distance Learning room.  Face-to-face students and others.
<a href="https://wrightstate.hosted.panopto.com/Panopto/Pages/Viewer.aspx?id=dcb3811e-a313-4ffa-b2f1-ac21014005ac">HCS-Lecture-on-08-26-2019</a> about 60 min.  Ignore the due dates
shown here.</li>
</ol></li>
</ol>
</div>

<div id="outline-container-orga6b1f41" class="outline-3">
<h3 id="orga6b1f41"><span class="section-number-3">2.1</span> Pilot</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>CEG 4420/6420 Sections 01.</li>
<li>WSU Pilot for submission of your work &#x2013; surveys, discussion, lab
reports, and exams.</li>
<li>WSU Pilot does <b>not</b> store my lecture notes.  The videos are stored
within Pilot Panopto.</li>
<li><a href="https://cecs.wright.edu/~pmateti/Courses/4420/Top/">https://cecs.wright.edu/~pmateti/Courses/4420/Top/</a> has links to
full lecture notes.</li>
</ol>
</div>
</div>


<div id="outline-container-orgca6b2b6" class="outline-3">
<h3 id="orgca6b2b6"><span class="section-number-3">2.2</span> Survey of Background</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Survey of your background: OS Internals and Design; Official Prereq: CEG4350</li>
<li>Did you take [the equivalent of] CEG 4350/6350 at WSU or elsewhere?
When? What was your textbook?</li>
<li>What Do you Think is: "Host Computer Security"?</li>
<li>"Computer Security"   [dropped the word Host]?</li>
<li>"Cyber Security"?</li>
<li>"Network Security"?</li>
<li>Post your answers on Pilot Discussion.  [This has a couple of extra
questions compared to what is on Pilot.]</li>
</ol>
</div>
</div>

<div id="outline-container-org34df640" class="outline-3">
<h3 id="org34df640"><span class="section-number-3">2.3</span> Course Overview</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li><a href="../Overview/4420-syllabus.html">Read the syllabus</a></li>
<li>Several Labs, No Homework, Two Exams</li>
<li>Books and other source material</li>
<li>What is Required Reading and Recommended Reading</li>
<li>Grading is "curved", but not necessarily to obtain a Gaussian distribution.</li>
<li>The due dates shown are tentative.</li>
<li><b>CEG6420: Extra Tasks.</b></li>
</ol>
</div>
</div>

<div id="outline-container-org3aeb0bc" class="outline-3">
<h3 id="org3aeb0bc"><span class="section-number-3">2.4</span> Terminology</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>Terminology: Hacker v. Attacker v. Intruder, DoS (Denial of
Service), Black Hats v. White Hats</li>
<li><a href="../Overview/index.html">Introduction to the Security Course</a></li>
</ol>
</div>
</div>

<div id="outline-container-org3f568e4" class="outline-3">
<h3 id="org3f568e4"><span class="section-number-3">2.5</span> L1 Getting Started</h3>
<div class="outline-text-3" id="text-2-5">
<ol class="org-ol">
<li>Lab on Getting Started  <a href="../LinuxSetup/gettingStartedLab.html">../LinuxSetup/gettingStartedLab.html</a></li>
<li>DAC and <code>sudo</code>.  Read <code>man sudoers</code></li>
<li>Study a Few Tiny Programs</li>
<li>Boot Up [Course Home Page]</li>
</ol>
</div>
</div>

<div id="outline-container-org0f8473a" class="outline-3">
<h3 id="org0f8473a"><span class="section-number-3">2.6</span> Study a Few Tiny Programs</h3>
<div class="outline-text-3" id="text-2-6">
<ol class="org-ol">
<li><a href="../LinuxSetup/StudyPrograms/index.html">../LinuxSetup/StudyPrograms/index.html</a> About 10.  Understand every
line of code.  syscalls. library calls.  strace. ltrace.</li>
<li>Task: Compile, run, and observe a few tiny programs</li>
<li>[These topics are covered in CEG2350  and CEG4350.]</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org76f1bd7" class="outline-2">
<h2 id="org76f1bd7"><span class="section-number-2">3</span> Recommended News Reading</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>A goal of this course is to be aware of current security incidents.</li>
<li>At an OS-internals level.  Way deeper than CNN TV e.g.</li>
<li>For now, start with
<ol class="org-ol">
<li><a href="https://cve.mitre.org/cve/">https://cve.mitre.org/cve/</a></li>
<li><a href="https://packetstormsecurity.com/">https://packetstormsecurity.com/</a></li>
<li><a href="https://securityfocus.com">https://securityfocus.com</a></li>
</ol></li>
<li>More links added later.</li>
</ol>
</div>
</div>

<div id="outline-container-orgcd42b55" class="outline-2">
<h2 id="orgcd42b55"><span class="section-number-2">4</span> End</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2020 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2020-08-25
</div>
</body>
</html>
